out/java.html
<!DOCTYPE html>
<html>
<head>
<title>Java 基础</title>
<!-- 2017-02-16 周四 13:52 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="imfine">
<link rel="stylesheet" href="nnn.css">
<meta name="viewport" content="width=device-width,initial-scale=1">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Java 基础</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 日期与时间</a>
<ul>
<li><a href="#sec-1-1">1.1. Date 类</a></li>
<li><a href="#sec-1-2">1.2. Calendar 类</a></li>
<li><a href="#sec-1-3">1.3. Date &lt;&#x2013;&gt; String 的转换</a></li>
</ul>
</li>
<li><a href="#sec-2">2. getter/setter</a></li>
</ul>
</div>
</nav>

<section id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 日期与时间</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Date 类</h3>
<div class="outline-text-3" id="text-1-1">
<p>
这是 java 最开始就有的类，用来处理时间。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b22222;">// </span><span style="color: #b22222;">&#33719;&#21462;&#24403;&#21069;&#26102;&#38388;</span>
<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">now</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #707183;">()</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25171;&#21360;&#26102;&#38388;&#65292;&#26174;&#24335;&#26684;&#24335;&#20026; Thu Nov 03 16:31:56 CST 2016</span>
System.out.println<span style="color: #707183;">(</span>now<span style="color: #707183;">)</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#33719;&#21462;&#26102;&#38388;&#20013;&#30340;&#24180;&#12289;&#26376;&#12289;&#26085;&#31561;</span>
System.out.println<span style="color: #707183;">(</span>now.getYear<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">&#27880;&#24847;&#65292;&#36825;&#26679;&#24471;&#21040;&#30340;&#26159;&#19968;&#20010;&#20943;&#21435;&#20102; 1990 &#30340;&#24180;&#20221;&#12290;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#24471;&#21040;&#20174; 1970 &#24180;&#21040;&#29616;&#22312;&#32463;&#36807;&#30340;&#27627;&#31186;&#25968;</span>
System.out.println<span style="color: #707183;">(</span>now.getTime<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25152;&#20197;&#24471;&#21040;&#20004;&#20010;&#26102;&#38388;&#30456;&#24046;&#22810;&#23569;&#19968;&#33324;&#36825;&#26679;&#34920;&#31034;</span>
<span style="color: #228b22;">long</span> <span style="color: #a0522d;">duration</span> = date1.getTime<span style="color: #707183;">()</span> - date2.getTime<span style="color: #707183;">()</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#24471;&#21040;&#25351;&#23450;&#26085;&#26399;&#30340;&#26102;&#38388;</span>
<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">time1</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #707183;">(</span>12212221<span style="color: #707183;">)</span>;
<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">time2</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"19900202"</span><span style="color: #707183;">)</span>;
<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">time3</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #707183;">(</span>1990, 1, 14<span style="color: #707183;">)</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#27880;&#24847;&#65292;&#26376;&#20221;&#20174;0&#24320;&#22987;&#35745;&#31639;&#12290;1&#36825;&#26465;&#35821;&#21477;&#34920;&#31034; 1990&#24180;2&#26376;14&#26085;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36890;&#36807; SimpleDateFormat &#30340;&#24418;&#24335;&#24471;&#21040;&#25351;&#23450;&#26684;&#24335;&#30340;&#26085;&#26399;</span>
<span style="color: #228b22;">Date</span> <span style="color: #a0522d;">time4</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">SimpleDateFormat</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"yyyyMMdd"</span><span style="color: #707183;">)</span>.parse<span style="color: #707183;">(</span><span style="color: #8b2252;">"20050205"</span><span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Calendar 类</h3>
<div class="outline-text-3" id="text-1-2">
<p>
后来由于 Date 类在处理国际化方面的一些局限，现在推荐用 Calendar 类代替 Date 类。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b22222;">// </span><span style="color: #b22222;">&#33719;&#21462;&#24403;&#21069;&#26102;&#38388;</span>
<span style="color: #228b22;">Calendar</span> <span style="color: #a0522d;">c</span> = Calendar.getInstance<span style="color: #707183;">()</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36890;&#36807; getTime &#33719;&#24471; Date &#23545;&#35937;&#12290;&#36890;&#36807;&#19979;&#38754;&#35821;&#21477;&#65292;&#25171;&#21360;&#24403;&#21069;&#26102;&#38388;</span>
System.out.println<span style="color: #707183;">(</span>c.getTime<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36890;&#36807;&#19979;&#38754;&#35821;&#21477;&#65292;&#33719;&#21462;&#24180;&#26376;&#26085;&#31561;</span>
System.out.println<span style="color: #707183;">(</span>c.get<span style="color: #7388d6;">(</span><span style="color: #008b8b;">Calendar</span>.YEAR<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36890;&#36807;&#19979;&#38754;&#35821;&#21477;&#65292;&#21021;&#22987;&#21270;&#19968;&#20010;&#20855;&#20307;&#26102;&#38388;</span>
c.set<span style="color: #707183;">(</span>1999, 2, 4<span style="color: #707183;">)</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25110;&#32773;&#36890;&#36807;&#26102;&#38388;&#31867;&#22411;&#24471;&#21040;</span>
c.setTime<span style="color: #707183;">(</span><span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25110;&#32773;&#65292;&#36890;&#36807;&#30452;&#25509;&#23454;&#20363;&#21270;&#19968;&#20010; Calendar &#30340;&#23454;&#29616;&#31867;&#65306;</span>
<span style="color: #228b22;">Calendar</span> <span style="color: #a0522d;">cc</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">GregorianCalendar</span><span style="color: #707183;">(</span>1998,3,11<span style="color: #707183;">)</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#19979;&#38754;&#35821;&#21477;&#24471;&#21040; 1970 &#24180;&#26469;&#30340; long &#20540;</span>
System.out.println<span style="color: #707183;">(</span>cc.getTimeInMillis<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Date &lt;&#x2013;&gt; String 的转换</h3>
<div class="outline-text-3" id="text-1-3">
<p>
SimpleDateFormat:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b22222;">// </span><span style="color: #b22222;">&#33258;&#34892;&#34917;&#20805;</span>
</pre>
</div>

<p>
注意，SimpleDateFormat 不是线程安全的!
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 其它</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
通过以上代码看以看到，通过 calendar.setTime()/getTime() 方法可以实现 Date/Calendar 对象的转换。
</p>

<p>
另外，为了方便， System 下面有个静态方法，也可以获取 1970 年到现在过了多少毫秒，返回时 long 值：、
</p>
<pre class="example">
System.currentTimeMillis();
</pre>
<p>
这个非常常用。
</p>
</div>
</div>
</div>
</section>



<section id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> getter/setter</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #008b8b;">@Test</span>
<span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">testGetterDate</span><span style="color: #707183;">()</span> <span style="color: #a020f0;">throws</span> <span style="color: #228b22;">Exception</span> <span style="color: #707183;">{</span>
    <span style="color: #228b22;">Author</span> <span style="color: #a0522d;">author</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Author</span><span style="color: #7388d6;">()</span>;
    author.setName<span style="color: #7388d6;">(</span><span style="color: #8b2252;">"&#24352;&#19977;"</span><span style="color: #7388d6;">)</span>;
    author.setBirth<span style="color: #7388d6;">(</span><span style="color: #a020f0;">new</span> <span style="color: #228b22;">SimpleDateFormat</span><span style="color: #909183;">(</span><span style="color: #8b2252;">"yyyy-MM-dd"</span><span style="color: #909183;">)</span>.parse<span style="color: #909183;">(</span><span style="color: #8b2252;">"1993-04-14"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;

    System.out.println<span style="color: #7388d6;">(</span><span style="color: #8b2252;">"&#29992;&#25143;&#21019;&#24314;&#25104;&#21151;&#12290;"</span><span style="color: #7388d6;">)</span>;

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#25509;&#19979;&#26469;&#33719;&#21462;&#24180;&#40836;&#65292;&#26377;&#22914;&#19979;&#26041;&#24335;&#65306;</span>

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#31532;&#19968;&#31181;&#20889;&#27861;&#65306;</span>
    System.out.println<span style="color: #7388d6;">(</span><span style="color: #8b2252;">"1. &#24180;&#40836;&#65306;"</span> + <span style="color: #909183;">(</span><span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #709870;">()</span>.getYear<span style="color: #709870;">()</span> - author.getBirth<span style="color: #709870;">()</span>.getYear<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#31532;&#20108;&#31181;&#26041;&#27861;&#65292;&#21019;&#24314;&#19968;&#20010;&#38745;&#24577;&#26041;&#27861;&#65292;&#36890;&#36807;&#35843;&#29992;&#65292;&#33719;&#21462;&#24180;&#40836;&#65306;</span>
    System.out.println<span style="color: #7388d6;">(</span><span style="color: #8b2252;">"2. &#24180;&#40836;&#65306;"</span> + BirthUtil.calAge<span style="color: #909183;">(</span>author.getBirth<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;

    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#31532;&#19977;&#31181;&#65292;&#22312; author &#31867;&#20013;&#65292;&#22686;&#21152;&#24180;&#40836;&#23383;&#27573;&#12290;&#22240;&#20026;&#24180;&#40836;&#20063;&#26159;&#20154;&#30340;&#19968;&#20010;&#23646;&#24615;&#12290;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#36825;&#26679;&#33021;&#26356;&#22909;&#30340;&#20307;&#29616;&#38754;&#21521;&#23545;&#35937;&#30340;&#24605;&#24819;&#65306;&#23553;&#35013;&#12290;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#22240;&#20026;&#24180;&#40836;&#36319;&#29983;&#26085;&#26377;&#20851;&#31995;&#65292;&#25152;&#20197;&#19981;&#38656;&#35201;&#26174;&#24335;&#36171;&#20540;&#65292;&#22914;&#26524;&#24819;&#33719;&#21462;&#65292;&#37027;&#20040;&#36890;&#36807;&#19979;&#38754;&#30340;&#26041;&#24335;&#65306;</span>
    System.out.println<span style="color: #7388d6;">(</span><span style="color: #8b2252;">"3. &#24180;&#40836;&#65306;"</span> + author.getAge<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>


<span style="color: #b22222;">// </span><span style="color: #b22222;">&#22312; getter &#26041;&#27861;&#20013;&#65292;&#21487;&#20197;&#20889;&#19968;&#20123;&#20855;&#20307;&#30340;&#36923;&#36753;&#12290;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36825;&#37324;&#36890;&#36807;&#29983;&#26085;&#30340;&#23383;&#27573;&#65292;&#35745;&#31639;&#24180;&#40836;&#12290;&#24403;&#35843;&#29992;&#36825;&#20010; getter &#26041;&#27861;&#30340;&#26102;&#20505;&#65292;&#25165;&#24320;&#22987;&#35745;&#31639;&#12290;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#32780;&#24180;&#40836;&#36825;&#20010;&#20540;&#65292;&#19981;&#38656;&#35201;&#20445;&#23384;&#21040;&#25968;&#25454;&#24211;&#20013;&#12290;&#25152;&#20197;&#19978;&#38754;&#38656;&#35201;&#22686;&#21152;&#19968;&#20010; @Transient &#27880;&#35299;&#65292;&#23558;&#20854;&#25490;&#20986;&#22312;&#22806;&#12290;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36825;&#31181;&#22788;&#29702;&#26041;&#24335;&#65292;&#26159;&#38750;&#24120;&#24120;&#35265;&#30340;&#12290;&#23588;&#20854;&#22312; getter/setter &#26041;&#27861;&#20013;&#65292;&#28155;&#21152;&#33258;&#24049;&#30340;&#36923;&#36753;&#65292;&#26377;&#26102;&#20505;&#65292;&#20250;&#20351;&#20195;&#30721;&#21464;&#24471;&#20415;&#25463;&#12290;</span>
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Author</span> <span style="color: #707183;">{</span>
    <span style="color: #a020f0;">private</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">age</span>;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">... others</span>
    <span style="color: #a020f0;">public</span> <span style="color: #228b22;">int</span> <span style="color: #0000ff;">getAge</span><span style="color: #7388d6;">()</span> <span style="color: #7388d6;">{</span>
        <span style="color: #a020f0;">return</span> age == 0 ? BirthUtil.calAge<span style="color: #909183;">(</span>birth<span style="color: #909183;">)</span> : age;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>


<span style="color: #b22222;">// </span><span style="color: #b22222;">&#26681;&#25454;&#29983;&#26085;&#35745;&#31639;&#24180;&#40836;&#30340;&#38745;&#24577;&#26041;&#27861;</span>
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">BirthUtil</span> <span style="color: #707183;">{</span>
    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #0000ff;">calAge</span><span style="color: #7388d6;">(</span><span style="color: #228b22;">Date</span> <span style="color: #a0522d;">birth</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #228b22;">Calendar</span> <span style="color: #a0522d;">cal</span> = Calendar.getInstance<span style="color: #909183;">()</span>;
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">now</span> = cal.get<span style="color: #909183;">(</span><span style="color: #008b8b;">Calendar</span>.YEAR<span style="color: #909183;">)</span>;
        cal.setTime<span style="color: #909183;">(</span>birth<span style="color: #909183;">)</span>;
        <span style="color: #a020f0;">return</span> now - cal.get<span style="color: #909183;">(</span><span style="color: #008b8b;">Calendar</span>.YEAR<span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: imfine</p>
<p class="date">Created: 2017-02-16 周四 13:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
